20MB/test8-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   278.931 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       9297.698 [ms] (mean)
Time per request:       9297.698 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        2837.77 kb/s sent
                        2837.80 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:  6880 9297 2221.0   8358   15521
Waiting:     5453 7730 2085.0   6929   13982
Total:       6880 9298 2221.0   8358   15521

Percentage of the requests served within a certain time (ms)
  50%   8358
  66%   9280
  75%  10270
  80%  10773
  90%  13466
  95%  14262
  98%  15521
  99%  15521
 100%  15521 (longest request)