20MB/test8-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   236.714 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7890.478 [ms] (mean)
Time per request:       7890.478 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3343.87 kb/s sent
                        3343.90 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:  5821 7890 1630.8   7591   12985
Waiting:     4548 6464 1591.8   6196   11585
Total:       5821 7890 1630.8   7591   12986

Percentage of the requests served within a certain time (ms)
  50%   7591
  66%   7811
  75%   8241
  80%   8862
  90%  10877
  95%  11380
  98%  12986
  99%  12986
 100%  12986 (longest request)