20MB/test9-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   243.321 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8110.695 [ms] (mean)
Time per request:       8110.695 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3253.08 kb/s sent
                        3253.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6516 8110 1170.7   7860   11397
Waiting:     5116 6607 1133.7   6422   10020
Total:       6517 8111 1170.7   7860   11397

Percentage of the requests served within a certain time (ms)
  50%   7860
  66%   8113
  75%   8585
  80%   8844
  90%   9883
  95%  11044
  98%  11397
  99%  11397
 100%  11397 (longest request)