20MB/test9-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   264.729 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       8824.300 [ms] (mean)
Time per request:       8824.300 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        2990.01 kb/s sent
                        2990.04 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6215 8824 2078.1   8155   15681
Waiting:     4672 7320 1981.4   6686   13696
Total:       6215 8824 2078.1   8156   15681

Percentage of the requests served within a certain time (ms)
  50%   8156
  66%   8934
  75%   9713
  80%  10943
  90%  11752
  95%  12355
  98%  15681
  99%  15681
 100%  15681 (longest request)